---
kind: other
id: Methods.T:Autodesk.Revit.DB.Instance
source: html/5bc0c760-dd0f-8d59-c009-9333b1b0f5b7.htm
---
# Instance Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.